IRP/src/Catalogs/AddAttributeAndPropertySets/AddAttributeAndPropertySets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>AddAttributeAndPropertySets</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>Catalog_ItemKeys</name>
   <description>Catalog Item keys</description>
  </items>
  <items>
   <name>Catalog_Items</name>
   <description>Catalog Items</description>
  </items>
  <items>
   <name>Catalog_ItemTypes</name>
   <description>Catalog Item types</description>
  </items>
  <items>
   <name>Document_SalesInvoice</name>
   <description>Document Sales invoice</description>
  </items>
  <items>
   <name>Catalog_Partners</name>
   <description>Catalog Partners</description>
  </items>
  <items>
   <name>Catalog_ExpenseAndRevenueTypes</name>
   <description>Catalog Expense and revenue types</description>
  </items>
  <items>
   <name>Catalog_BusinessUnits</name>
   <description>Catalog Business units</description>
  </items>
  <items>
   <name>Catalog_PriceKeys</name>
   <description>Catalog Price keys</description>
  </items>
  <items>
   <name>Document_SalesOrder</name>
   <description>Document Sales order</description>
  </items>
  <items>
   <name>Catalog_ChequeBonds</name>
   <description>Catalog Cheque bonds</description>
  </items>
  <items>
   <name>Catalog_Specifications</name>
   <description>Catalog Specifications</description>
  </items>
  <items>
   <name>Document_PurchaseInvoice</name>
   <description>Document Purchase invoice</description>
  </items>
  <items>
   <name>Document_PurchaseOrder</name>
   <description>Document Purchase order</description>
  </items>
  <items>
   <name>Catalog_Agreements</name>
   <description>Catalog Agreements</description>
  </items>
  <items>
   <name>Catalog_CashAccounts</name>
   <description>Catalog Cash accounts</description>
  </items>
  <items>
   <name>Catalog_Companies</name>
   <description>Catalog Companies</description>
  </items>
  <items>
   <name>Catalog_CompanyTypes</name>
   <description>Catalog Company types</description>
  </items>
  <items>
   <name>Catalog_Countries</name>
   <description>Catalog Countries</description>
  </items>
  <items>
   <name>Catalog_Currencies</name>
   <description>Catalog Currencies</description>
  </items>
  <items>
   <name>Catalog_PriceTypes</name>
   <description>Catalog Price types</description>
  </items>
  <items>
   <name>Catalog_SerialLotNumbers</name>
   <description>Catalog Serial lot numbers</description>
  </items>
  <items>
   <name>Catalog_Stores</name>
   <description>Catalog Stores</description>
  </items>
  <items>
   <name>Catalog_Taxes</name>
   <description>Catalog Taxes</description>
  </items>
  <items>
   <name>Catalog_Units</name>
   <description>Catalog Units</description>
  </items>
  <items>
   <name>Catalog_Users</name>
   <description>Catalog Users</description>
  </items>
  <items>
   <name>Document_BankPayment</name>
   <description>Document Bank payment</description>
  </items>
  <items>
   <name>Document_BankReceipt</name>
   <description>Document Bank receipt</description>
  </items>
  <items>
   <name>Document_Bundling</name>
   <description>Document Bundling</description>
  </items>
  <items>
   <name>Document_CashExpense</name>
   <description>Document Cash expense</description>
  </items>
  <items>
   <name>Document_CashPayment</name>
   <description>Document Cash payment</description>
  </items>
  <items>
   <name>Document_CashReceipt</name>
   <description>Document Cash receipt</description>
  </items>
  <items>
   <name>Document_CashRevenue</name>
   <description>Document Cash revenue</description>
  </items>
  <items>
   <name>Document_CashTransferOrder</name>
   <description>Document Cash transfer order</description>
  </items>
  <items>
   <name>Document_ChequeBondTransaction</name>
   <description>Document Cheque bond transaction</description>
  </items>
  <items>
   <name>Document_GoodsReceipt</name>
   <description>Document Goods receipt</description>
  </items>
  <items>
   <name>Document_IncomingPaymentOrder</name>
   <description>Document Incoming payment order</description>
  </items>
  <items>
   <name>Document_InventoryTransfer</name>
   <description>Document Inventory transfer</description>
  </items>
  <items>
   <name>Document_InventoryTransferOrder</name>
   <description>Document Inventory transfer order</description>
  </items>
  <items>
   <name>Document_InvoiceMatch</name>
   <description>Document Invoice match</description>
  </items>
  <items>
   <name>Document_Labeling</name>
   <description>Document Labeling</description>
  </items>
  <items>
   <name>Document_OpeningEntry</name>
   <description>Document Opening entry</description>
  </items>
  <items>
   <name>Document_OutgoingPaymentOrder</name>
   <description>Document Outgoing payment order</description>
  </items>
  <items>
   <name>Document_PhysicalCountByLocation</name>
   <description>Document Physical count by location</description>
  </items>
  <items>
   <name>Document_PhysicalInventory</name>
   <description>Document Physical inventory</description>
  </items>
  <items>
   <name>Document_PriceList</name>
   <description>Document Price list</description>
  </items>
  <items>
   <name>Document_PurchaseReturn</name>
   <description>Document Purchase return</description>
  </items>
  <items>
   <name>Document_PurchaseReturnOrder</name>
   <description>Document Purchase return order</description>
  </items>
  <items>
   <name>Document_ReconciliationStatement</name>
   <description>Document Reconciliation statement</description>
  </items>
  <items>
   <name>Document_SalesReturn</name>
   <description>Document Sales return</description>
  </items>
  <items>
   <name>Document_SalesReturnOrder</name>
   <description>Document Sales return order</description>
  </items>
  <items>
   <name>Document_ShipmentConfirmation</name>
   <description>Document Shipment confirmation</description>
  </items>
  <items>
   <name>Document_StockAdjustmentAsSurplus</name>
   <description>Document Stock adjustment as surplus</description>
  </items>
  <items>
   <name>Document_StockAdjustmentAsWriteOff</name>
   <description>Document Stock adjustment as write off</description>
  </items>
  <items>
   <name>Document_Unbundling</name>
   <description>Document Unbundling</description>
  </items>
  <items>
   <name>Catalog_Files</name>
   <description>Catalog Files</description>
  </items>
  <items>
   <name>Document_RetailSalesReceipt</name>
   <description>Document Retail sales receipt</description>
  </items>
  <items>
   <name>Catalog_PaymentTerminals</name>
   <description>Catalog Payment terminals</description>
  </items>
  <items>
   <name>Document_RetailReturnReceipt</name>
   <description>Document Retail return receipt</description>
  </items>
  <items>
   <name>Catalog_BankTerms</name>
   <description>Catalog Bank terms</description>
  </items>
  <items>
   <name>Catalog_RetailCustomers</name>
   <description>Catalog Retail customers</description>
  </items>
  <items>
   <name>Document_CashStatement</name>
   <description>Document Cash statement</description>
  </items>
  <items>
   <name>Catalog_CashStatementStatuses</name>
   <description>Catalog Cash statement statuses</description>
  </items>
  <items>
   <name>Document_CreditNote</name>
   <description>Document Credit note</description>
  </items>
  <items>
   <name>Document_DebitNote</name>
   <description>Document Debit note</description>
  </items>
  <items>
   <name>Catalog_Workstations</name>
   <description>Catalog Workstations</description>
  </items>
  <items>
   <name>Catalog_Hardware</name>
   <description>Catalog Hardware</description>
  </items>
  <items>
   <name>Catalog_ItemSegments</name>
   <description>Catalog Item segments</description>
  </items>
  <items>
   <name>Catalog_PartnerSegments</name>
   <description>Catalog Partner segments</description>
  </items>
  <items>
   <name>Catalog_PaymentTypes</name>
   <description>Catalog Payment types</description>
  </items>
  <items>
   <name>Catalog_SpecialOfferRules</name>
   <description>Catalog Special offer rules</description>
  </items>
  <items>
   <name>Catalog_SpecialOffers</name>
   <description>Catalog Special offers</description>
  </items>
  <items>
   <name>Catalog_SpecialOfferTypes</name>
   <description>Catalog Special offer types</description>
  </items>
  <items>
   <name>Catalog_TaxRates</name>
   <description>Catalog Tax rates</description>
  </items>
  <items>
   <name>Catalog_UserGroups</name>
   <description>Catalog User groups</description>
  </items>
  <items>
   <name>Document_InternalSupplyRequest</name>
   <description>Document Internal supply request</description>
  </items>
  <items>
   <name>Catalog_PartnersBankAccounts</name>
   <description>Catalog Partners bank accounts</description>
  </items>
  <items>
   <name>Catalog_LockDataModificationReasons</name>
   <description>Catalog Lock data modification reasons</description>
  </items>
  <items>
   <name>Document_ItemStockAdjustment</name>
   <description>Document Item stock adjustment</description>
  </items>
  <items>
   <name>Document_ManualRegisterEntry</name>
   <description>Document Manual register entry</description>
  </items>
  <items>
   <name>Document_SalesOrderClosing</name>
   <description>Document Sales order closing</description>
  </items>
  <items>
   <name>Document_PlannedReceiptReservation</name>
  </items>
  <items>
   <name>Document_PurchaseOrderClosing</name>
   <description>Document Purchase order closing</description>
  </items>
 </predefined>
 <tabularSections>
  <name>Attributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Condition</name>
   <type>
    <types>ValueStorage</types>
   </type>
  </attributes>
  <attributes>
   <name>IsConditionSet</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InterfaceGroup</name>
   <comment>Name of group for attribute</comment>
   <type>
    <types>CatalogRef.InterfaceGroups</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Properties</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Condition</name>
   <type>
    <types>ValueStorage</types>
   </type>
  </attributes>
  <attributes>
   <name>IsConditionSet</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ExtensionAttributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>128</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InterfaceGroup</name>
   <comment>Name of group for attribute</comment>
   <type>
    <types>CatalogRef.InterfaceGroups</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Show</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PriceTypes/PriceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PriceTypes</name>
 <predefined>
  <items>
   <name>ManualPriceType</name>
   <description>Manual price type</description>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProcSettings</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ObjectStatuses</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>SalesOrder</name>
   <description>Sales order</description>
  </items>
  <items>
   <name>SalesReturnOrder</name>
   <description>Sales return order</description>
  </items>
  <items>
   <name>PurchaseOrder</name>
   <description>Purchase order</description>
  </items>
  <items>
   <name>PurchaseReturnOrder</name>
   <description>Purchase return order</description>
  </items>
  <items>
   <name>InventoryTransferOrder</name>
   <description>Inventory transfer order</description>
  </items>
  <items>
   <name>OutgoingPaymentOrder</name>
   <description>Outgoing payment order</description>
  </items>
  <items>
   <name>ReconciliationStatement</name>
   <description>Reconciliation statement</description>
  </items>
  <items>
   <name>ChequeBondTransaction</name>
   <description>Cheque bond transaction</description>
  </items>
  <items>
   <name>PhysicalCountByLocation</name>
   <description>Physical count by location</description>
  </items>
  <items>
   <name>PhysicalInventory</name>
   <description>Physical inventory</description>
  </items>
 </predefined>
 <attributes>
  <name>SetByDefault</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Posting</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingAdvanced</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingPartnerAccountTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingReconciliationStatement</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingAccountBalance</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingPlaningCashTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingChequeBondBalance</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>NextPossibleStatuses</name>
  <attributes>
   <name>Status</name>
   <type>
    <types>CatalogRef.ObjectStatuses</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/FillingFromClassifiers/Module.bsl
Procedure OnCreateAtServer(Form, Cancel, StandardProcessing) Export
	NewCommand = Form.Commands.Add("CreateFromClassifier");
	NewCommand.Action = "CreateFromClassifier";
	NewCommand.Title = R().Form_025;
	
	NewItem = Form.Items.Add("CreateFromClassifier",
	                                 Type("FormButton"),
									 Form.CommandBar);
	NewItem.CommandName = "CreateFromClassifier";
EndProcedure

Function GetClassifierData(MetadataName) Export
	ClassifierData = New Array;
	CurrentMetadata = Metadata.FindByFullName(MetadataName);
	If CurrentMetadata = Undefined Then
		Return ClassifierData;
	EndIf;
	For Each Template In CurrentMetadata.Templates Do
		If StrFind(Upper(Template.Name), Upper("Classifier_JSON")) <> 0 Then
			TemplateData = ServiceSystemServer.GetManagerByMetadata(CurrentMetadata).GetTemplate(Template.Name);
			CurrentClassifierData = CommonFunctionsServer.DeserializeJSON(TemplateData.GetText());
			If TypeOf(CurrentClassifierData) = Type("Array") Then
				For Each CurrentClassifierElement In CurrentClassifierData Do
					ClassifierData.Add(CurrentClassifierElement);
				EndDo;
			EndIf;
		EndIf;
	EndDo;
	Return ClassifierData;
EndFunction

Function GetElementFromClassifier(MetadataName, KeyName, KeyValue) Export
	ClassifierData = GetClassifierData(MetadataName);
	If ClassifierData <> Undefined Then
		For Each ClassifierElement In ClassifierData Do
			If Lower(ClassifierElement[KeyName]) = Lower(KeyValue) Then
				Return ClassifierElement;
			EndIf;
		EndDo;
	EndIf;
	Return Undefined;
EndFunction

Function CreateCatalogItemFromClassifier(MetadataName, KeyName, KeyValue) Export
	ClassifierElement = GetElementFromClassifier(MetadataName, KeyName, KeyValue);
	Return CheckExistingAndCreateCatalogItemFromClassifierElement(MetadataName, ClassifierElement);
EndFunction

Function CreateCatalogItemFromClassifierElement(MetadataName, ClassifierElement) Export
	CurrentManager = ServiceSystemServer.GetManagerByMetadataFullName(MetadataName);
	If CurrentManager = Undefined Then
		Return Undefined;
	EndIf;
	If ClassifierElement <> Undefined Then
		NewObject = CurrentManager.CreateItem();
		DisassembleClassifierElement_Structure(NewObject, ClassifierElement);
		
		// Fill descriptions
		DescriptionStr = DescriptionStructure();
		FillPropertyValues(DescriptionStr, NewObject);
		For Each KeyAndValue In DescriptionStr Do
			If IsBlankString(KeyAndValue.Value) Then
				DescriptionStr[KeyAndValue.Key] = DescriptionStr["Description_en"];
			EndIf;
		EndDo;
		FillPropertyValues(NewObject, DescriptionStr);
		
		NewObject.Write();
		Return NewObject.Ref;
	Else
		Return CurrentManager.EmptyRef();
	EndIf;
EndFunction

Procedure DisassembleClassifierElement_Structure(NewObject, ClassifierElement)
	For Each KeyAndValue In ClassifierElement Do
		DisassembleClassifierElement_KeyAndValue(NewObject, KeyAndValue);
	EndDo;
EndProcedure

Procedure DisassembleClassifierElement_KeyAndValue(NewObject, KeyAndValue)
	If TypeOf(KeyAndValue.Value) = Type("Structure") Then
		If KeyAndValue.Key = "TabularSection" Then
			For Each TabularSection In KeyAndValue.Value Do
				DisassembleClassifierElement_TabularSection(NewObject, TabularSection);
			EndDo;
		Else
			MetadataType = Undefined;
			If KeyAndValue.Value.Property("MetadataType", MetadataType) Then
				If StrFind(MetadataType, "Catalog") <> 0 Then
					NewObject[KeyAndValue.Key] = CheckExistingAndCreateCatalogItemFromClassifierElement(
									MetadataType, KeyAndValue.Value, False);
				EndIf;
				If StrFind(MetadataType, "Enum") <> 0 Then
					EnumManager = ServiceSystemServer.GetManagerByMetadataFullName(MetadataType);
					If EnumManager <> Undefined Then
						NewObject[KeyAndValue.Key] = EnumManager[KeyAndValue.Value.Value];
					EndIf;
				EndIf;
				If StrFind(MetadataType, "ValueStorage_Structure") <> 0 Then
					ValueStorage_Structure = New Structure(); 
					For Each ValueStorage_KeyAndValue In KeyAndValue.Value Do
						If ValueStorage_KeyAndValue.Key <> "MetadataType" Then
							ValueStorage_Structure.Insert(ValueStorage_KeyAndValue.Key);
						EndIf;
					EndDo;
					DisassembleClassifierElement_Structure(ValueStorage_Structure, KeyAndValue.Value);
					NewObject[KeyAndValue.Key] = New ValueStorage(ValueStorage_Structure, New Deflation(9));	
				EndIf;
				If StrFind(MetadataType, "ValueStorage_ExtData") <> 0 Then
					NewObject[KeyAndValue.Key] = GetBinaryDataFromTemplate(KeyAndValue.Value);		
				EndIf;
			EndIf;
		EndIf;
	Else
		// primitive type
		FillingStructure = New Structure(KeyAndValue.Key, KeyAndValue.Value);
		FillPropertyValues(NewObject, FillingStructure);
	EndIf;
EndProcedure

Procedure DisassembleClassifierElement_TabularSection(NewObject, TabularSection)
	For Each TabularSectionRow In TabularSection.Value Do
		NewRow = NewObject[TabularSection.Key].Add();
		 DisassembleClassifierElement_Structure(NewRow, TabularSectionRow);
	EndDo;
EndProcedure

Function CheckExistingAndCreateCatalogItemFromClassifierElement(MetadataName, ClassifierElement, OwnClassifier = True) Export
	If TypeOf(ClassifierElement) <> Type("Structure") OR Not ClassifierElement.Count() Then
		CurrentManager = ServiceSystemServer.GetManagerByMetadataFullName(MetadataName);
		If CurrentManager = Undefined Then
			Return Undefined;
		EndIf;
		Return CurrentManager.EmptyRef();
	EndIf;
	
	For Each KeyAndValue In ClassifierElement Do
		SearchingKeyAndValue = KeyAndValue;
		Break;
	EndDo;
	
	// Step1: Check existing item
	Query = New Query(
	"SELECT TOP 1
	|	Table.Ref
	|FROM
	|	Catalog.%1 AS Table
	|WHERE
	|	Table.%2 = &%2");
	Query.Text = StrTemplate(Query.Text, Mid(MetadataName, 9), SearchingKeyAndValue.Key);
	Query.SetParameter(SearchingKeyAndValue.Key, SearchingKeyAndValue.Value);
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	
	// Step2: Try create from Metadata own classifier
	If Not OwnClassifier Then
		ItemFromMetadataClassifier = CreateCatalogItemFromClassifier(
					MetadataName, SearchingKeyAndValue.Key, SearchingKeyAndValue.Value);
		If ValueIsFilled(ItemFromMetadataClassifier) Then
			Return ItemFromMetadataClassifier;
		EndIf;
	EndIf;
	
	// Step3: Create from this ClassifierElement
	Return CreateCatalogItemFromClassifierElement(MetadataName, ClassifierElement);
EndFunction

Function GetBinaryDataFromTemplate(ClassifierElement) Export
	Var TemplatePath, TemplateName;
	
	If Not ClassifierElement.Property("TemplateName", TemplateName) 
			OR Not ClassifierElement.Property("TemplatePath", TemplatePath) Then
		Return Undefined;
	EndIf;
	
	CurrentMetadata = Metadata.FindByFullName(TemplatePath);
	If CurrentMetadata = Undefined Then
		Return Undefined;
	EndIf;
		
	For Each Template In CurrentMetadata.Templates Do
		If Upper(Template.Name) = Upper(TemplateName) Then
			TemplateData = ServiceSystemServer.GetManagerByMetadata(CurrentMetadata).GetTemplate(Template.Name);
			Return New ValueStorage(TemplateData, New Deflation(9));
		EndIf;	
	EndDo;
	
	Return Undefined;
EndFunction
	
Function DescriptionStructure(Description = "") Export
	Str = New Structure();
	Str.Insert("Description_" + LocalizationReuse.GetLocalizationCode()	, Description);
	Str.Insert("Description_en"											, Description);
	Str.Insert("Description"											, Description);
	Return Str;
EndFunction

Procedure FillDescriptionOfPredefinedCatalogs() Export
    
    LocalCodes = LocalizationCodesList();

	ValueTable = New ValueTable;
	ValueTable.Columns.Add("Ref");
	ValueTable.Columns.Add("DescriptionMap");

	Obj = Catalogs.AddAttributeAndPropertySets;
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Agreements, 					"Description_A001");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_BusinessUnits, 				"Description_A003");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_CashAccounts, 					"Description_A004");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_ChequeBonds, 					"Description_A005");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Companies, 					"Description_A006");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_CompanyTypes, 					"Description_A007");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Countries, 					"Description_A008");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Currencies, 					"Description_A009");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_ExpenseAndRevenueTypes, 		"Description_A010");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_ItemKeys, 						"Description_A011");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Items, 						"Description_A012");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_ItemTypes, 					"Description_A013");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Partners, 						"Description_A014");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_PriceKeys, 					"Description_A015");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_PriceTypes, 					"Description_A016");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_SerialLotNumbers, 				"Description_A017");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Specifications, 				"Description_A018");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Stores, 						"Description_A019");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Taxes, 						"Description_A020");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Units, 						"Description_A021");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Catalog_Users, 						"Description_A022");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_BankPayment, 					"Description_A023");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_BankReceipt, 					"Description_A024");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_Bundling, 					"Description_A025");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashExpense, 					"Description_A026");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashPayment, 					"Description_A027");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashReceipt, 					"Description_A028");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashRevenue, 					"Description_A029");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashTransferOrder, 			"Description_A030");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_ChequeBondTransaction, 		"Description_A031");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_GoodsReceipt, 				"Description_A032");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_IncomingPaymentOrder, 		"Description_A033");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_InventoryTransfer, 			"Description_A034");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_InventoryTransferOrder, 		"Description_A035");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_InvoiceMatch, 				"Description_A036");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_Labeling, 					"Description_A037");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_OpeningEntry, 				"Description_A038");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_OutgoingPaymentOrder, 		"Description_A039");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PhysicalCountByLocation, 		"Description_A040");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PhysicalInventory, 			"Description_A041");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PriceList, 					"Description_A042");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseInvoice, 				"Description_A043");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseOrder, 				"Description_A044");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseReturn, 				"Description_A045");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseReturnOrder, 			"Description_A046");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_ReconciliationStatement, 		"Description_A047");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesInvoice, 				"Description_A048");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesOrder, 					"Description_A049");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesReturn, 					"Description_A050");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesReturnOrder, 			"Description_A051");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_ShipmentConfirmation, 		"Description_A052");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_StockAdjustmentAsSurplus, 	"Description_A053");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_StockAdjustmentAsWriteOff, 	"Description_A054");
    AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_Unbundling, 					"Description_A056");

	AddRowToDescriptionList (ValueTable, LocalCodes, Catalogs.PriceTypes.ManualPriceType, "Description_A057");
	
	Obj = Catalogs.ObjectStatuses;
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.ChequeBondTransaction, 	"Description_A031"); 
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.ChequeBondIncoming, 		"Description_A058"); 
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.ChequeBondOutgoing, 		"Description_A059"); 
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.InventoryTransferOrder, 	"Description_A035");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.OutgoingPaymentOrder, 		"Description_A039");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.PhysicalCountByLocation, 	"Description_A040");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.PhysicalInventory, 		"Description_A041");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.PurchaseOrder, 			"Description_A044");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.PurchaseReturnOrder, 		"Description_A046");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.ReconciliationStatement, 	"Description_A047");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.SalesOrder, 				"Description_A049");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.SalesReturnOrder, 			"Description_A051");

	Obj = Catalogs.CurrencyMovementSets;
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseReturnOrder, 	"Description_A046");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_BankPayment, 			"Description_A023");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_BankReceipt, 			"Description_A024");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashExpense, 			"Description_A026");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashPayment, 			"Description_A027");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashReceipt, 			"Description_A028");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashRevenue, 			"Description_A029");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CashTransferOrder, 	"Description_A030"); 
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_IncomingPaymentOrder, "Description_A033");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_InvoiceMatch, 		"Description_A036");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_OutgoingPaymentOrder, "Description_A039");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseInvoice, 		"Description_A043"); 
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseOrder, 		"Description_A044");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_PurchaseReturn, 		"Description_A045");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesInvoice, 		"Description_A048");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesOrder, 			"Description_A049");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesReturn, 			"Description_A050");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_SalesReturnOrder, 	"Description_A051");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_CreditNote, 		    "Description_A062");
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.Document_DebitNote, 		    "Description_A063");
	Obj = ChartsOfCharacteristicTypes.CurrencyMovementType;
	AddRowToDescriptionList (ValueTable, LocalCodes, Obj.SettlementCurrency, "Description_A061");
	
	FillAndWriteDescriptions (ValueTable);

EndProcedure

Function LocalizationCodesList()
    
    LocalizationCodes = New Array;
    LocalizationCodes.Add("en");
    Return LocalizationCodes;
    
EndFunction

Procedure AddRowToDescriptionList (CatalogList, LocalizationCodes,  Ref, R_StringName)

    NewRow = CatalogList.Add();
    NewRow.Ref = Ref;
    Map = New Map;
    For Each LocalCodeRow In LocalizationCodes Do
        Map.Insert("Description_" + LocalCodeRow, R(LocalCodeRow)[R_StringName]);
    EndDo;
    NewRow.DescriptionMap = Map;
    
EndProcedure

Procedure FillAndWriteDescriptions(ObjectTable)

	For Each CurRow In ObjectTable Do
		Object = CurRow.Ref.GetObject();
		ObjectChanged = False;
		For Each Description In CurRow.DescriptionMap Do
			If Not Object[Description.Key] = Description.Value Then
				Object[Description.Key] = Description.Value;
				ObjectChanged = True;
			EndIf;
		EndDo;
		If ObjectChanged Then
			Object.Write();
		EndIf;
	EndDo;

EndProcedure
